#include <SFML\Graphics.hpp>
const int HEIGHT_MAP = 25;//размер карты высота
const int WIDTH_MAP = 40;//размер карты ширина 

// Here I am making a blank for the card

sf::String TileMap[HEIGHT_MAP] = 
{
	"0000000000000000000000000000000000000000",
	"0                                      000000000000",
	"0   s                                             0",
	"0                                                 0",
   	"0               x                      000000000000",
	"0                              s       0",
	"0                                      0",
	"0                                      0",
	"0                     g                0",
	"0                                      0",
	"0              s                       0",
	"0                             x        0",
	"0                                      0",
	"0                                      0",
	"0                x                     0",
	"0         g                            0",
	"0                                      0",
	"0                    s                 0",
	"0                                      0",
	"0                                      0",
	"0          s                           0",
	"0        000000                        0",
	"0        000000             g          0",
	"0        000000                        0",
	"0000000000000000000000000000000000000000",
};
